app/views/opus/index.html.erb

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 4 LIMIT 1
---
    <td><%= opu.id %></td>
    <% customer = Customer.find(opu.customer_id) %>