app/views/payments/index.html.erb

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 4 LIMIT 1
---
    <td><%= payment.opu_sn %></td>
    <td><%= Customer.find(payment.customer_id).first + " " + Customer.find(payment.customer_id).last rescue nil%></td>