app/controllers/csn_customers_controller.rb

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 4 LIMIT 1
INSERT INTO `payments` (`amount`, `created_at`, `customer_id`, `date`, `opu_id`, `opu_sn`, `updated_at`) VALUES (1.2, '2013-10-28 23:19:13', 4, '2013-10-28 23:19:13', NULL, '13110000C83A351FB380', '2013-10-28 23:19:13')
SELECT `opus`.* FROM `opus` WHERE `opus`.`sn` = '13110000C83A351FB380' LIMIT 1
UPDATE `opus` SET `activation_date` = '2013-10-28 23:19:15', `expiration_date` = '2013-11-29 00:19:15', `updated_at` = '2013-10-28 23:19:15' WHERE `opus`.`id` = 13
---
  def addPayment
    if params[:token]
      if params[:token] == "uewyiyutywegfysdvcj"
        customer = Customer.find(params[:user_id]) rescue nil
        if customer
            payment = Payment.new()
            payment.customer_id = params[:user_id].to_i
            payment.amount = params[:amount]
            payment.opu_sn = params[:sn]
            payment.date = Time.now
            if payment.save
              opu = Opu.find_by_sn(payment.opu_sn)
              #code for making sure the activation request went through
              savon_client = Savon::Client.new("http://c4miws.elasticbeanstalk.com/services/C4miForCiaoWebServiceImpl?wsdl")
              session[:auth] = "C4miforciao2013"
              session[:phone] = customer.phone
              session[:opu] = payment.opu_sn
              #@response = savon_client.request :web, :activate, body: {auth: "C4miforciao2013", phoneNum: "2434325434534", opuSn: "10110000C83A3531D808", enableService: "1"}
              @response = savon_client.request :web, :activate, body: {auth: session[:auth], phoneNum: session[:phone], opuSn: session[:opu], enableService: "1"}
              @message = ActiveSupport::JSON.decode(@response.to_hash[:activate_response][:activate_return].gsub(/:([a-zA-z])/,'\\1'))
              if @message["success"] == "true"
                if payment.save

SELECT `customers`.* FROM `customers` WHERE `customers`.`first` = 'FIRST' AND `customers`.`last` = 'LAST' LIMIT 1
SELECT COUNT(*) FROM `customers` WHERE `customers`.`first` = 'FIRST' AND `customers`.`last` = 'LAST'
INSERT INTO `opus` (`activation_date`, `created_at`, `customer_id`, `expiration_date`, `sn`, `status`, `updated_at`) VALUES (NULL, '2013-10-28 22:58:12', 7, NULL, 'asds3wew', 'Not active', '2013-10-28 22:58:12')
---
  def addOpu
    if params[:token]
        if params[:token] == "uewyiyutywegfysdvcj"
          opu = Opu.new()
          opu.status = "Not active"
          first = params[:first]
          last = params[:last]
          @customer = Customer.where(first: first, last: last) rescue nil
          if not @customer.empty?
            opu.customer_id = @customer.first[:id] rescue nil
            opu.sn = params[:sn]
            if opu.save