app/controllers/customers_controller.rb

SELECT `customers`.* FROM `customers`
---
  def index
    @customers = Customer.all

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 4 LIMIT 1
SELECT `opus`.* FROM `opus` WHERE `opus`.`customer_id` = 4
---
  def show
    @customer = Customer.find(params[:id])
    @opu_names = []
    @opus = Opu.where(:customer_id => @customer.id)

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 4 LIMIT 1
SELECT `payments`.* FROM `payments` WHERE `payments`.`customer_id` = 4
---
  def payment_history
    @customer = Customer.find(params[:id])
    @payments = Payment.where(:customer_id => @customer.id)

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 13 LIMIT 1
DELETE FROM `customers` WHERE `customers`.`id` = 13
---
  def destroy
    @customer = Customer.find(params[:id])
    @customer.destroy