app/controllers/home_controller.rb

SELECT `customers`.* FROM `customers` WHERE `customers`.`status` = 'Active'
---
    def reports
      @active_customers = Customer.where(:status => "Active")