app/controllers/opus_controller.rb

SELECT `opus`.* FROM `opus`
---
  def index
    @opus = Opu.all

SELECT `opus`.* FROM `opus` WHERE `opus`.`id` = 14 LIMIT 1
---
  def show
    @opu = Opu.find(params[:id])

INSERT INTO `opus` (`activation_date`, `created_at`, `customer_id`, `expiration_date`, `sn`, `status`, `updated_at`) VALUES (NULL, '2013-10-28 22:21:04', 4, NULL, 'wqscxs', 'Not Active', '2013-10-28 22:21:04')
---
  def create
    @opu = Opu.new(params[:opu])
    respond_to do |format|
      if @opu.save

SELECT `opus`.* FROM `opus` WHERE `opus`.`id` = 14 LIMIT 1
DELETE FROM `opus` WHERE `opus`.`id` = 14
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 4 LIMIT 1
---
  def destroy
    @opu = Opu.find(params[:id])
    @opu.destroy
    customer = Customer.find(@opu.customer_id)