app/controllers/payments_controller.rb

  def index
    if params['viewFrom']
      @from_date = Time.new(params['viewFrom']['from(1i)'], params['viewFrom']['from(2i)'], params['viewFrom']['from(3i)'])
    else
      @from_date = Time.now - 1.days
    end
    if params['viewTo']
      @to_date = Time.new(params['viewTo']['to(1i)'], params['viewTo']['to(2i)'], params['viewTo']['to(3i)'])
    else
      @to_date = Time.now
    end
    @from_date = @from_date.strftime("%Y-%m-%d") + ' 00:00:00'
    @to_date = @to_date.strftime("%Y-%m-%d") + ' 23:59:59'
    if params['viewFrom'] and params['viewTo']
      puts "DATEEEEE"
      puts @from_date.to_datetime
      puts @to_date.to_datetime
      #@payments = ActiveRecord::Base.connection.execute("SELECT * FROM payments WHERE date between '#{@from_date}' and  '#{@to_date}'")
      @payments = Payment.where(date: (@from_date.to_datetime..@to_date.to_datetime))
    else
      @payments = Payment.order(sort_column + ' ' + sort_direction)
---
SELECT `payments`.* FROM `payments` WHERE (`payments`.`date` BETWEEN '2013-12-06 00:00:00' AND '2013-12-09 23:59:59')
SELECT `payments`.* FROM `payments` ORDER BY opu_sn asc

  def show
    if params[:id].to_s == "index"
      redirect_to "/payments/?direction=#{params[:direction]}&sort=#{params[:sort]}"
    else
      @payment = Payment.find(params[:id])
---
SELECT `payments`.* FROM `payments` WHERE `payments`.`id` = 45 LIMIT 1

  def destroy
    @payment = Payment.find(params[:id])
    @payment.destroy
---
SELECT `payments`.* FROM `payments` WHERE `payments`.`id` = 45 LIMIT 1
DELETE FROM `payments` WHERE `payments`.`id` = 45